In [8]:
import pandas as pd

#### Задание 2.4

In [9]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})
countries_df

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [10]:
countries_df_copy = countries_df.copy()
countries_df_copy

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [11]:
countries_df_copy['density'] = countries_df_copy['population'] / countries_df_copy['square'] * 10**6
countries_df_copy['density']

0    421.976671
1      3.810842
2     32.796595
3      8.539467
4     75.377550
5     45.761079
6      6.253436
Name: density, dtype: float64

In [12]:
density_mean = round(countries_df_copy['density'].mean(), 2)
density_mean

84.93

### Задание 3.4, 3.5

In [ ]:
ufo_data = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv')

In [ ]:
ufo_df = ufo_data.copy()
ufo_df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
ufo_df['Time'] = pd.to_datetime(ufo_df['Time'], dayfirst=True)
ufo_df.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-01-06 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-01-06 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [ ]:
ufo_df['Time'].dt.year.mode()

0    1999
Name: Time, dtype: int64

In [ ]:
ufo_df['Time'] = ufo_df['Time'].dt.date

In [ ]:
ufo_df_nevada = ufo_df[ufo_df['State'] == 'NV'].copy()
ufo_df_nevada.head()

           City Colors Reported Shape Reported State        Time
76    Las Vegas             NaN           DISK    NV  1947-07-15
172  Nellis AFB             NaN           DISK    NV  1952-02-17
565      Fallon             NaN           OVAL    NV  1959-09-15
566   Goldfield             NaN          LIGHT    NV  1959-09-15
613         NaN             NaN           DISK    NV  1960-01-07

In [ ]:
ufo_df_nevada['TimeDiff'] = ufo_df_nevada['Time'].diff()
ufo_df_nevada.head()

           City Colors Reported Shape Reported State        Time  TimeDiff
76    Las Vegas             NaN           DISK    NV  1947-07-15       NaT
172  Nellis AFB             NaN           DISK    NV  1952-02-17 1678 days
565      Fallon             NaN           OVAL    NV  1959-09-15 2767 days
566   Goldfield             NaN          LIGHT    NV  1959-09-15    0 days
613         NaN             NaN           DISK    NV  1960-01-07  114 days

In [ ]:
ufo_df_nevada['TimeDiff'].mean()

Timedelta('68 days 17:18:01.272084806')